// Строгий режим
"use strict";

/* Желательно после каждой инструкции в коцне ставить точку с запятой */

// Литерал - значения для инструкций
// Литерал - целого числа
let num = 20;
// Литерал - дробного числа
let num_f = 2.5;
// Литерал - Строки
let str = "Привет";

/* Выражение это совокупность литералов, переменных, операторов и тд*/

// Переменные - константа, ячейки памяти в которых хранится информация.
// В константе значение не может изменяться в ходе выполнения кода.
const BIRTHDAY = "25.04.2007"; // константа дня рождения которая не будет меняться
let user_name = "max"; // переменная пользователя которую в ходе выполнения можно будет изменить

// Операторы + - * / операция которую нужно выполнить
console.log(10 + 10);
console.log(10 - 10);
console.log(5 * 5);
console.log(4 / 2);
